Documents/Операция.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>Операция</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Проводки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Проводки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетДт</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.СчетаУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоДт1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.Субконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоДт2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.Субконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоДт3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.Субконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоДт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетКт</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.СчетаУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКт1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.Субконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКт2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.Субконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКт3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.Субконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоКт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccountingRegisters/Проводки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccountingRegister>
		<Properties>
			<Name>Проводки</Name>
			<ChartOfAccounts>ChartOfAccounts.СчетаУчета</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.СчетаУчета.AccountingFlag.Количественный</AccountingFlag>
				</Properties>
			</Resource>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Documents/Операция/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Для каждого СтрокаТЧ Из Проводки Цикл
		Проводка = Движения.Проводки.Добавить();
		Проводка.Период = Дата;
		Проводка.Организация = Организация;
		Проводка.СчетДт = СтрокаТЧ.СчетДт;
		Если Проводка.СчетДт.ВидыСубконто.Количество() > 0 Тогда
			Проводка.СубконтоДт.Вставить(Проводка.СчетДт.ВидыСубконто[0].ВидСубконто, СтрокаТЧ.СубконтоДт1);
			Если Проводка.СчетДт.ВидыСубконто.Количество() > 1 Тогда
				Проводка.СубконтоДт.Вставить(Проводка.СчетДт.ВидыСубконто[1].ВидСубконто, СтрокаТЧ.СубконтоДт2);
				Если Проводка.СчетДт.ВидыСубконто.Количество() > 2 Тогда
					Проводка.СубконтоДт.Вставить(Проводка.СчетДт.ВидыСубконто[2].ВидСубконто, СтрокаТЧ.СубконтоДт3);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Проводка.КоличествоДт = СтрокаТЧ.КоличествоДт;
		Проводка.СчетКт = СтрокаТЧ.СчетКт;
		Если Проводка.СчетКт.ВидыСубконто.Количество() > 0 Тогда
			Проводка.СубконтоКт.Вставить(Проводка.СчетКт.ВидыСубконто[0].ВидСубконто, СтрокаТЧ.СубконтоКт1);
			Если Проводка.СчетКт.ВидыСубконто.Количество() > 1 Тогда
				Проводка.СубконтоКт.Вставить(Проводка.СчетКт.ВидыСубконто[1].ВидСубконто, СтрокаТЧ.СубконтоКт2);
				Если Проводка.СчетКт.ВидыСубконто.Количество() > 2 Тогда
					Проводка.СубконтоКт.Вставить(Проводка.СчетКт.ВидыСубконто[2].ВидСубконто, СтрокаТЧ.СубконтоКт3);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Проводка.КоличествоКт = СтрокаТЧ.КоличествоКт;
		Проводка.Сумма = СтрокаТЧ.Сумма;
	КонецЦикла;
	
	Движения.Проводки.Записать();
КонецПроцедуры
